
let arr = [
  {
    "A": "购物(电商)",
    "B": "综合商场"
  },
  {
    "A": "",
    "B": "便利店"
  },
  {
    "A": "",
    "B": "超市"
  },
  {
    "A": "",
    "B": "花鸟鱼虫"
  },
  {
    "A": "",
    "B": "家具家居建材"
  },
  {
    "A": "",
    "B": "体育户外"
  },
  {
    "A": "",
    "B": "服饰鞋包"
  },
  {
    "A": "",
    "B": "图书音像"
  },
  {
    "A": "",
    "B": "眼镜店"
  },
  {
    "A": "",
    "B": "母婴儿童"
  },
  {
    "A": "",
    "B": "珠宝首饰"
  },
  {
    "A": "",
    "B": "化妆品"
  },
  {
    "A": "",
    "B": "食品烟酒"
  },
  {
    "A": "",
    "B": "数码家电"
  },
  {
    "A": "",
    "B": "农贸市场"
  },
  {
    "A": "",
    "B": "小商品市场"
  },
  {
    "A": "",
    "B": "旧货市场"
  },
  {
    "A": "",
    "B": "商业步行街"
  },
  {
    "A": "",
    "B": "礼品"
  },
  {
    "A": "",
    "B": "摄影器材"
  },
  {
    "A": "",
    "B": "钟表店"
  },
  {
    "A": "",
    "B": "拍卖典当行"
  },
  {
    "A": "",
    "B": "古玩字画"
  },
  {
    "A": "",
    "B": "自行车专卖"
  },
  {
    "A": "",
    "B": "文化用品"
  },
  {
    "A": "",
    "B": "药店"
  },
  {
    "A": "",
    "B": "品牌折扣"
  },
  {
    "A": "",
    "B": "其它购物"
  },
  {
    "A": "美食",
    "B": "江浙菜"
  },
  {
    "A": "",
    "B": "粤菜"
  },
  {
    "A": "",
    "B": "川菜"
  },
  {
    "A": "",
    "B": "湘菜"
  },
  {
    "A": "",
    "B": "东北菜"
  },
  {
    "A": "",
    "B": "徽菜"
  },
  {
    "A": "",
    "B": "闽菜"
  },
  {
    "A": "",
    "B": "鲁菜"
  },
  {
    "A": "",
    "B": "台湾菜"
  },
  {
    "A": "",
    "B": "西北菜"
  },
  {
    "A": "",
    "B": "东南亚菜"
  },
  {
    "A": "",
    "B": "西餐"
  },
  {
    "A": "",
    "B": "日韩菜"
  },
  {
    "A": "",
    "B": "火锅"
  },
  {
    "A": "",
    "B": "清真菜"
  },
  {
    "A": "",
    "B": "小吃快餐"
  },
  {
    "A": "",
    "B": "海鲜"
  },
  {
    "A": "",
    "B": "烧烤"
  },
  {
    "A": "",
    "B": "自助餐"
  },
  {
    "A": "",
    "B": "面包甜点"
  },
  {
    "A": "",
    "B": "茶餐厅"
  },
  {
    "A": "",
    "B": "咖啡厅"
  },
  {
    "A": "",
    "B": "其他美食"
  },
  {
    "A": "休闲娱乐",
    "B": "洗浴推拿足浴"
  },
  {
    "A": "",
    "B": "KTV"
  },
  {
    "A": "",
    "B": "酒吧"
  },
  {
    "A": "",
    "B": "咖啡厅"
  },
  {
    "A": "",
    "B": "茶馆"
  },
  {
    "A": "",
    "B": "电影院"
  },
  {
    "A": "",
    "B": "棋牌游戏"
  },
  {
    "A": "",
    "B": "夜总会"
  },
  {
    "A": "",
    "B": "剧场音乐厅"
  },
  {
    "A": "",
    "B": "度假疗养"
  },
  {
    "A": "",
    "B": "户外活动"
  },
  {
    "A": "",
    "B": "网吧"
  },
  {
    "A": "",
    "B": "迪厅"
  },
  {
    "A": "",
    "B": "演出票务"
  },
  {
    "A": "",
    "B": "其他娱乐休闲"
  },
  {
    "A": "生活服务",
    "B": "家政"
  },
  {
    "A": "",
    "B": "宠物服务"
  },
  {
    "A": "",
    "B": "旅行社"
  },
  {
    "A": "",
    "B": "摄影冲印"
  },
  {
    "A": "",
    "B": "洗衣店"
  },
  {
    "A": "",
    "B": "票务代售"
  },
  {
    "A": "",
    "B": "邮局速递"
  },
  {
    "A": "",
    "B": "通讯服务"
  },
  {
    "A": "",
    "B": "彩票"
  },
  {
    "A": "",
    "B": "报刊亭"
  },
  {
    "A": "",
    "B": "自来水营业厅"
  },
  {
    "A": "",
    "B": "电力营业厅"
  },
  {
    "A": "",
    "B": "教练"
  },
  {
    "A": "",
    "B": "生活服务场所"
  },
  {
    "A": "",
    "B": "信息咨询中心"
  },
  {
    "A": "",
    "B": "招聘求职"
  },
  {
    "A": "",
    "B": "中介机构"
  },
  {
    "A": "",
    "B": "事务所"
  },
  {
    "A": "",
    "B": "丧葬"
  },
  {
    "A": "",
    "B": "废品收购站"
  },
  {
    "A": "",
    "B": "福利院养老院"
  },
  {
    "A": "",
    "B": "测字风水"
  },
  {
    "A": "",
    "B": "家装"
  },
  {
    "A": "",
    "B": "其他生活服务"
  },
  {
    "A": "结婚",
    "B": "婚纱摄影"
  },
  {
    "A": "",
    "B": "婚宴"
  },
  {
    "A": "",
    "B": "婚戒首饰"
  },
  {
    "A": "",
    "B": "婚纱服饰"
  },
  {
    "A": "",
    "B": "婚庆公司"
  },
  {
    "A": "",
    "B": "彩妆造型"
  },
  {
    "A": "",
    "B": "司仪主持"
  },
  {
    "A": "",
    "B": "婚礼跟拍"
  },
  {
    "A": "",
    "B": "婚车租赁"
  },
  {
    "A": "",
    "B": "婚礼小商品"
  },
  {
    "A": "",
    "B": "婚房装修"
  },
  {
    "A": "",
    "B": "其他"
  },
  {
    "A": "丽人",
    "B": "美发"
  },
  {
    "A": "",
    "B": "美容"
  },
  {
    "A": "",
    "B": "SPA"
  },
  {
    "A": "",
    "B": "瘦身纤体"
  },
  {
    "A": "",
    "B": "美甲"
  },
  {
    "A": "",
    "B": "写真"
  },
  {
    "A": "",
    "B": "其他"
  },
  {
    "A": "酒店宾馆",
    "B": "星级酒店"
  },
  {
    "A": "",
    "B": "经济型酒店"
  },
  {
    "A": "",
    "B": "公寓式酒店"
  },
  {
    "A": "",
    "B": "度假村"
  },
  {
    "A": "",
    "B": "农家院"
  },
  {
    "A": "",
    "B": "青年旅社"
  },
  {
    "A": "",
    "B": "酒店宾馆"
  },
  {
    "A": "",
    "B": "旅馆招待所"
  },
  {
    "A": "",
    "B": "其他酒店宾馆"
  },
  {
    "A": "亲子",
    "B": "亲子摄影"
  },
  {
    "A": "",
    "B": "亲子游乐"
  },
  {
    "A": "",
    "B": "亲子购物"
  },
  {
    "A": "",
    "B": "孕产护理"
  },
  {
    "A": "旅游景点",
    "B": "公园"
  },
  {
    "A": "",
    "B": "其他旅游景点"
  },
  {
    "A": "",
    "B": "风景名胜"
  },
  {
    "A": "",
    "B": "植物园"
  },
  {
    "A": "",
    "B": "动物园"
  },
  {
    "A": "",
    "B": "水族馆"
  },
  {
    "A": "",
    "B": "城市广场"
  },
  {
    "A": "",
    "B": "世界遗产"
  },
  {
    "A": "",
    "B": "国家级景点"
  },
  {
    "A": "",
    "B": "省级景点"
  },
  {
    "A": "",
    "B": "纪念馆"
  },
  {
    "A": "",
    "B": "寺庙道观"
  },
  {
    "A": "",
    "B": "教堂"
  },
  {
    "A": "",
    "B": "海滩"
  },
  {
    "A": "运动健身",
    "B": "健身中心"
  },
  {
    "A": "",
    "B": "游泳馆"
  },
  {
    "A": "",
    "B": "瑜伽"
  },
  {
    "A": "",
    "B": "羽毛球馆"
  },
  {
    "A": "",
    "B": "乒乓球馆"
  },
  {
    "A": "",
    "B": "篮球场"
  },
  {
    "A": "",
    "B": "足球场"
  },
  {
    "A": "",
    "B": "壁球场"
  },
  {
    "A": "",
    "B": "马场"
  },
  {
    "A": "",
    "B": "高尔夫场"
  },
  {
    "A": "",
    "B": "保龄球馆"
  },
  {
    "A": "",
    "B": "溜冰"
  },
  {
    "A": "",
    "B": "跆拳道"
  },
  {
    "A": "",
    "B": "海滨浴场"
  },
  {
    "A": "",
    "B": "网球场"
  },
  {
    "A": "",
    "B": "橄榄球"
  },
  {
    "A": "",
    "B": "台球馆"
  },
  {
    "A": "",
    "B": "滑雪"
  },
  {
    "A": "",
    "B": "舞蹈"
  },
  {
    "A": "",
    "B": "攀岩馆"
  },
  {
    "A": "",
    "B": "射箭馆"
  },
  {
    "A": "",
    "B": "综合体育馆"
  },
  {
    "A": "",
    "B": "其他运动健身"
  },
  {
    "A": "教育学校",
    "B": "小学"
  },
  {
    "A": "",
    "B": "幼儿园"
  },
  {
    "A": "",
    "B": "其他教育学校"
  },
  {
    "A": "",
    "B": "培训"
  },
  {
    "A": "",
    "B": "大学"
  },
  {
    "A": "",
    "B": "中学"
  },
  {
    "A": "",
    "B": "职业技术学校"
  },
  {
    "A": "",
    "B": "成人教育"
  },
  {
    "A": "房产小区",
    "B": "住宅区"
  },
  {
    "A": "",
    "B": "产业园区"
  },
  {
    "A": "",
    "B": "商务楼宇"
  },
  {
    "A": "",
    "B": "其它房产小区"
  },
  {
    "A": "医疗保健",
    "B": "专科医院"
  },
  {
    "A": "",
    "B": "综合医院"
  },
  {
    "A": "",
    "B": "诊所"
  },
  {
    "A": "",
    "B": "急救中心"
  },
  {
    "A": "",
    "B": "药房药店"
  },
  {
    "A": "",
    "B": "疾病预防"
  },
  {
    "A": "",
    "B": "其它医疗保健"
  },
  {
    "A": "汽车",
    "B": "加油站"
  },
  {
    "A": "",
    "B": "停车场"
  },
  {
    "A": "",
    "B": "4S店"
  },
  {
    "A": "",
    "B": "汽车维修"
  },
  {
    "A": "",
    "B": "驾校"
  },
  {
    "A": "",
    "B": "汽车租赁"
  },
  {
    "A": "",
    "B": "汽车配件销售"
  },
  {
    "A": "",
    "B": "汽车保险"
  },
  {
    "A": "",
    "B": "摩托车"
  },
  {
    "A": "",
    "B": "汽车养护"
  },
  {
    "A": "",
    "B": "汽车场"
  },
  {
    "A": "",
    "B": "汽车俱乐部"
  },
  {
    "A": "",
    "B": "汽车救援"
  },
  {
    "A": "",
    "B": "二手车交易市场"
  },
  {
    "A": "",
    "B": "车辆管理机构"
  },
  {
    "A": "",
    "B": "其他汽车"
  },
  {
    "A": "文化场馆",
    "B": "博物馆"
  },
  {
    "A": "",
    "B": "图书馆"
  },
  {
    "A": "",
    "B": "美术馆"
  },
  {
    "A": "",
    "B": "展览馆"
  },
  {
    "A": "",
    "B": "科技馆"
  },
  {
    "A": "",
    "B": "天文馆"
  },
  {
    "A": "",
    "B": "档案馆"
  },
  {
    "A": "",
    "B": "文化馆"
  },
  {
    "A": "",
    "B": "会展中心"
  },
  {
    "A": "",
    "B": "其他文化场馆"
  },
  {
    "A": "银行金融",
    "B": "银行"
  },
  {
    "A": "",
    "B": "自动提款机"
  },
  {
    "A": "",
    "B": "保险公司"
  },
  {
    "A": "",
    "B": "证券公司"
  },
  {
    "A": "",
    "B": "财务公司"
  },
  {
    "A": "",
    "B": "其他银行金融"
  },
  {
    "A": "机构团体",
    "B": "公检法机构"
  },
  {
    "A": "",
    "B": "外国机构"
  },
  {
    "A": "",
    "B": "工商税务机构"
  },
  {
    "A": "",
    "B": "政府机关"
  },
  {
    "A": "",
    "B": "民主党派"
  },
  {
    "A": "",
    "B": "社会团体"
  },
  {
    "A": "",
    "B": "传媒机构"
  },
  {
    "A": "",
    "B": "文艺团体"
  },
  {
    "A": "",
    "B": "科研机构"
  },
  {
    "A": "",
    "B": "其他机构团体"
  },
  {
    "A": "地名地址",
    "B": "交通地名"
  },
  {
    "A": "",
    "B": "地名地址信息"
  },
  {
    "A": "",
    "B": "道路名"
  },
  {
    "A": "",
    "B": "自然地名"
  },
  {
    "A": "",
    "B": "行政地名"
  },
  {
    "A": "",
    "B": "门牌信息"
  },
  {
    "A": "",
    "B": "其他地名地址"
  },
  {
    "A": "基础设施",
    "B": "交通设施"
  },
  {
    "A": "",
    "B": "公共设施"
  },
  {
    "A": "",
    "B": "道路附属"
  },
  {
    "A": "",
    "B": "其它基础设施"
  },
  {
    "A": "公司企业",
    "B": "农林牧渔基地"
  },
  {
    "A": "",
    "B": "企业/工厂"
  },
  {
    "A": "",
    "B": "其他公司企业"
  },
  {
    "A": "其他",
    "B": "其他"
  }
]
let newArr = []
let obj
for (var i = 0; i < arr.length; i++) {
  let map = {}
  if (!map[arr[i]['A']] && arr[i]['A']) {
    map[arr[i]['A']] = arr[i]['A']
    obj = {
      label: arr[i]['A'],
      value: arr[i]['A'],
      children: [
        {
          label: arr[i]['B'],
          value: arr[i]['B']
        }
      ]
    }
    newArr.push(obj)
  } else {
    obj.children.push(
      {
        label: arr[i]['B'],
        value: arr[i]['B']
      }
    )
  }
}